[
  {
    "path": "fallstudien/BE_N_0_Vorbemerkung/",
    "title": "Vorbemerkung Fallstudie WPZ - Profil N",
    "description": {},
    "author": [
      {
        "name": "Beni Sigrist",
        "url": {}
      }
    ],
    "date": "2021-10-11",
    "categories": [
      "Biodiversity & Ecosystems (N)"
    ],
    "contents": "\r\nAktuell dient diese Plattform für die BiEc Fallstudie - Profil N einzig der Bereitstellung von Aufgaben die von euch im Rahmen dieses Fallstudienprojekts erarbeitet werden sollen. Die Aufgaben werden in den meisten Fällen mit Code-Beispielen erläutert oder benötigten Code-snippets resp. Funktionen werden mitgeliefert. Im Laufe des Semesters werden hier ausserdem häppchenweise (mögliche) Lösungen zu den Aufgaben aufgeschaltet. Alles grundlegende Material und alle Unterlagen zu den theoretischen Inputs sind weiterhin und ausschliesslich im Moodlekurs Research Methods - Fallstudie BiEc zu finden. Die für die Aufgaben benötigten Datengrundlagen sind ebenfalls im entsprechenden Abschnitt auf Moodle zu finden. Frohes Schaffen!\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "fallstudien/BE_N_0_Vorbemerkung/Reh_graf.jpg",
    "last_modified": "2021-10-18T09:00:13+02:00",
    "input_file": {}
  },
  {
    "path": "fallstudien/BE_N_1_Aufgabe3_Datenverarbeitung/",
    "title": "KW42: Daten(vor)verarbeitung Fallstudie WPZ - Profil N",
    "description": {},
    "author": [
      {
        "name": "Beni Sigrist",
        "url": {}
      }
    ],
    "date": "2021-10-14",
    "categories": [
      "Biodiversity & Ecosystems (N)"
    ],
    "contents": "\r\nProjektaufbau RStudio-Projekte\r\nVor den eigentlichen Auswertungen muessen einige vorbereitende Arbeiten unternommen werden. Die Zeit, die man hier investiert, wird in der spaeteren Projektphase um ein vielfaches eingespart. Im Skript soll die Ordnerstruktur des Projekts genannt werden, damit der Arbeitsvorgang auf verschiedenen Rechnern reproduzierbar ist.\r\nArbeitet mit Projekten, da diese sehr einfach ausgetauscht und somit auch reproduziert werden koennen; es gibt keine absoluten Arbeitspfade sondern nur relative. Der Datenimport (und auch der Export) kann mithilfe dieser relativen Pfaden stark vereinfacht werden. Projekte helfen alles am richtigen Ort zu behalten. (mehr zur Arbeit mit Projekten: https://support.rstudio.com/hc/en-us/articles/200526207-Using-Projects)\r\nAufbau von R-Skripten\r\nIm Kopf des Skripts zuerst immer den Titel des Projekts sowie die Autor:innen des Skripts nennen. Hier soll auch die Herkunft der Daten ersichtlich sein und falls externe Daten verwendet werden, sollte geklaert werden, wer die Datenherrschaft hat (Rehdaten: Forschungsgruppe WILMA).\r\n\r\n\r\n#.##################################################################################\r\n# Daten(vor)verarbeitung Fallstudie WPZ  ####\r\n# Modul Research Methods, HS21. Autor/in ####\r\n#.##################################################################################\r\n\r\n# Beschreibt zudem folgendes:\r\n# • Ordnerstruktur (ich verwende hier den Projektordner mit den Unterordnern Skripts, \r\n# Feldaufnahmen, Data, Results, Plots)\r\n# • Verwendete Daten\r\n\r\n# Ein Skript soll in R eigentlich immer nach dem selbem Schema aufgebaut sein. \r\n# Dieses Schema beinhaltet (nach dem bereits erwaehnten Kopf des Skripts) 4 Kapitel: \r\n\r\n\r\n\r\n1. Datenimport\r\n2. Datenvorverarbeitung\r\n3. Analyse\r\n4. Visualisierung\r\nBereitet euer Skript also nach dieser Struktur vor. Nutzt fuer den Text, welcher nicht Code ist, vor dem Text das Symbol #. Wenn ihr den Text als Titel definieren wollt, der die grobe Struktur des Skripts absteckt, baut in wie in folgendem Beispiel auf:\r\n\r\n\r\n#.###################################################################################\r\n# METADATA ####\r\n#.###################################################################################\r\n# Datenherkunft ####\r\n# ...\r\n\r\n#.###################################################################################\r\n# 1. DATENIMPORT ####\r\n#.###################################################################################\r\n\r\n\r\n\r\nlibraries laden: hier tidyverse\r\n\r\n\r\nlibrary(tidyverse)\r\n\r\n\r\n\r\nHerunterladen der Daten der Feldaufnahmen von Moodle (Aufgabe3_Feldaufnahmen_alle_Gruppen.zip), Einlesen, Sichtung der Datensaetze und der Datentypen\r\n\r\n\r\n# Die Datensätze aller Teams müssen erst noch in CSVs umgewandelt werden, bevor sie \r\n# eingelesen werden können \r\n\r\ndf_team1 <- read_delim(\"Felderhebung Waldstruktur_TEAM_1_türkis.csv\", \r\n                       delim = \";\")\r\n\r\ndf_team2 <- read_delim(\"Felderhebung_Team_2.csv\", delim = \";\")\r\n# Achtung! Beim Datensatz des Teams 2 ist eine zusaetzliche Zeile eingefuegt, die\r\n# das Einlesen erschwert.\r\n# Ausserdem gibt es bei den Zeilen DG Rubus, DG Strauchschicht und DG Baumschicht ein  \r\n# Problem mit dem Datentyp resp. den Zahlen.\r\n\r\ndf_team3 <- read_delim(\"ReMe_Felderhebung_Gruppe3.csv\", delim = \";\")\r\n# Achtung! Hier ist beim Einlesen etwas falsch gelaufen. \r\n\r\ndf_team4 <- read_delim(\"Felderhebung_Waldstruktur_Team_4.csv\", \r\n                       delim = \";\")\r\n\r\ndf_team5 <- read_delim(\"Felderhebung_Waldstruktur_Team5.csv\", \r\n                       delim = \";\")\r\n# Achtung! Beim Umwandeln in das CSV muss hier die Titelzeile entfernt werden damit\r\n# das Einlesen reibungslos funktioniert\r\n\r\ndf_team6 <- read_delim(\"Aufnahmen_Landforst_HS21_Gruppe_6.csv\", \r\n                       delim = \";\")\r\n\r\n\r\n# hier koennen die Probekreise mit den Angaben zur Anzahl Rehlokalisationen und der \r\n# LIDAR-basierten Ableitung der Waldstruktur eingelesen werden\r\n\r\ndf_reh <- read_delim(\"Aufgabe3_Reh_Waldstruktur_211014.csv\", delim = \";\")\r\nstr(df_reh)\r\n\r\n\r\n# Die eingelesenen Datensaetze anschauen und versuchen zu einem Gesamtdatensatz  \r\n# verbinden. Ist der Output zufriedenstellend?\r\n\r\ndf_gesamt <- bind_rows(df_team1, df_team2, df_team3, df_team4, df_team5, df_team6)\r\nstr(df_gesamt)\r\n\r\n\r\n\r\nAufgabe 1:\r\n1.1 Einfuegen zusaetzliche Spalte pro Datensatz mit der Gruppenzugehoerigkeit (Team1-6)\r\n1.2 Spaltenumbenennung damit die Bezeichungen in allen Datensaetzen gleich sind und der Gesamtdatensatz zusammengefuegt werden kann\r\n–> Befehle mutate und rename, mit pipes (%>%) in einem Schritt moeglich\r\nAufgabe 2:\r\nZusammenfuehren der Teildatensaetze zu einem Datensatz\r\nAufgabe 3:\r\nVerbinden (join) des Datensatzes der Felderhebungen mit dem Datensatz der Rehe.\r\nZiel: ein Datensatz mit allen Kreisen der Felderhebung, angereichert mit den Umweltvariablen Understory und Overstory aus den LIDAR-Daten (DG_us, DG_os) aus dem Rehdatensatz.\r\n–> Welche Art von join? Welche Spalten zum Verbinden (by = ?) der Datensaetze\r\nAufgabe 4:\r\nScatterplot der korrespondondierenden Umweltvariablen aus den Felderhebungen gegen die Umweltvariablen aus den LIDAR-Daten erstellen (zusaetzlich Einfaerben der Gruppen und Regressionslinie darueberlegen).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-18T09:00:14+02:00",
    "input_file": {}
  },
  {
    "path": "fallstudien/BE_N_2_Aufgabe3_Berechnung_Homeranges/",
    "title": "KW43: Homeranges Fallstudie WPZ - Profil N",
    "description": {},
    "author": [
      {
        "name": "Beni Sigrist",
        "url": {}
      }
    ],
    "date": "2021-10-14",
    "categories": [
      "Biodiversity & Ecosystems (N)"
    ],
    "contents": "\r\nR-Skript zur Berechung der Home-Ranges der Rehe\r\nBenötigte Libraries laden\r\n\r\n\r\nipak <- function(pkg){\r\nnew.pkg <- pkg[!(pkg %in% installed.packages()[, \"Package\"])]\r\nif (length(new.pkg))\r\ninstall.packages(new.pkg, dependencies = TRUE)\r\nsapply(pkg, require, character.only = TRUE)\r\n}\r\npackages <- c(\"sf\", \"raster\", \"tidyverse\", \"adehabitatHR\", \"maptools\", \"sp\", \r\n              \"ggspatial\", \"rgeos\", \"rgdal\")\r\nipak(packages)\r\n\r\n\r\n\r\nEinlesen des Gesamtdatensatzes von Moodle, Sichtung des Datensatzes und der Datentypen\r\n\r\n\r\nRehe <- read_delim(\"Aufgabe3_Homeranges_Rehe_landforst_20211014.csv\", delim = \";\")\r\n\r\nstr(Rehe)\r\n\r\n\r\n\r\nAufgabe 1: In Datensatz Rehe eine neue Spalte mit Datum und Zeit in einer Spalte kreieren. Beim Format hat sich ein Fehler eingeschlichen. Findet ihr ihn?\r\n\r\n\r\nRehe <- Rehe %>%\r\n  mutate(UTC_DateTime = as.POSIXct(paste(UTC_Date, UTC_Time), \r\n                                   format = \"%Y-%m-%d %H:%M:%S\"))\r\n\r\n\r\n\r\nHier einige Zeilen Code, um eine HomeRange zu berechnen.\r\nAufgabe 2: Herumschrauben an den Einstellungen von:\r\n- href (in der Funktion kernelUD)\r\n- an der Ausdehung, resp. prozentualer Anteil Punkte in der HR (Funktion getverticeshr)\r\n–> Ziel: eine Karte erstellen mit der Visualiserung mindestens einer HR\r\n\r\n\r\nx <- Rehe$X[Rehe$TierID== \"RE13\"]    \r\ny <- Rehe$Y[Rehe$TierID== \"RE13\"]\r\nxy <- data.frame(cbind (x, y, rep(1, length(x))))       \r\ncoordinates(xy)<-c(\"x\",\"y\")                             \r\nproj4string(xy)<-CRS(\"+init=epsg:21781\")  \r\n\r\nplot(xy, col = \"blue\", pch = 19, cex = 1.5)\r\n\r\n# Berechnung von href nach: Pebsworth et al. (2012) Evaluating home range techniques: \r\n# use of Global Positioning System (GPS) collar data from chacma baboons\r\n\r\nsigma <- 0.5*(sd(x)+sd(y))                              \r\nn <- length(x)\r\nhref <- sigma * n^(-1/6)*0.9  \r\n\r\n# scaled reference: href * 0.9\r\n\r\nkud <- kernelUD(xy, h=href, grid=25)             \r\n\r\n# Berechnung der Home Range (95% Isopleth)\r\n\r\nhomerange <- getverticeshr(kud, percent=95)             \r\n\r\n\r\n# Schreibt HR in den oben beschriebenen Ordner (als Shapefile)\r\n\r\nhr <- st_as_sf(homerange)\r\n\r\nst_write(hr, dsn= \"Results\", layer=\"HR_RE13\", driver=\"ESRI Shapefile\",  \r\n         delete_layer = T )\r\n\r\n\r\n\r\n\r\n\r\n# mit diesem Befehl kann die HR geplottet werden\r\n\r\n\r\nggplot(hr, aes(color = \"red\", fill=\"red\")) + \r\n  geom_sf(size = 1, alpha = 0.3) +\r\ncoord_sf(datum = sf::st_crs(21781))+\r\ntheme(\r\naxis.title = element_blank(),\r\naxis.text = element_blank(),\r\naxis.ticks = element_blank(),\r\nlegend.position=\"none\"\r\n)\r\n\r\n# und die Punkte der GPS-Lokalisationen darüber gelegt werden \r\n\r\nxy_p <- st_as_sf(xy)\r\n\r\nggplot(hr, aes(color = \"red\", fill=\"red\")) + \r\n  geom_sf(size = 1, alpha = 0.3) +\r\ngeom_sf(data = xy_p, aes(fill = \"red\")) +\r\ncoord_sf(datum = sf::st_crs(21781))+\r\ntheme(\r\naxis.title = element_blank(),\r\naxis.text = element_blank(),\r\naxis.ticks = element_blank(),\r\nlegend.position=\"none\"\r\n)\r\n\r\n\r\n\r\nCode um die Homerange auf der Landeskarte 1:25000 zu plotten. Transparenz kann mit alpha angepasst werden\r\n\r\n\r\npk25_wpz <- brick(\"C:/Users/sigb/Beni/WPZ_Fallstudie/HS20/Data/pk25_wpz.tif\")\r\n\r\nxy_p <- st_as_sf(xy)\r\n\r\nggplot(hr, aes(color = \"red\", fill=\"red\")) +\r\nannotation_spatial(pk25_wpz) +\r\ngeom_sf(size = 1, alpha = 0.3) +\r\ngeom_sf(data = xy_p, aes(fill = \"red\")) +\r\ncoord_sf(datum = sf::st_crs(21781))+\r\ntheme(\r\naxis.title = element_blank(),\r\naxis.text = element_blank(),\r\naxis.ticks = element_blank(),\r\nlegend.position=\"none\"\r\n)\r\n\r\n\r\n\r\nErstellen des Sampling Grids mit den Kreisen (Wird als Grundlage für Extraktion der Umweltvariablen innerhalb der Homeranges benötigt)\r\nXmin bzw. Ymin des Grids: c(684000, 234000)\r\ncellsize des Grids: c(25, 25)\r\nAnzahl Kreise in X und Y Richtung: c(100, 160)\r\n\r\n\r\nx25       <- GridTopology(c(684000, 234000), c(25, 25), c(100, 160)) \r\ndata25    = data.frame(1:(100*160))           \r\n# Erstellt aus der GridTopology und den Daten ein SpatialGridDataFrame\r\ngrid25    <- SpatialGridDataFrame(x25, data25,  proj4string <- CRS(\"+init=epsg:21781\"))\r\npixel25   <- as(grid25, \"SpatialPixelsDataFrame\")\r\n\r\n\r\n# zweites Sampling Grid für einen Ausschnitt aufbauen, plotten\r\n# -> dient nur der Visualisierung des Sampling Grids um einen Eindruck zu erhalten\r\n\r\nx       <- GridTopology(c(684200, 236900), c(25, 25), c(35, 35)) \r\ndata    = data.frame(1:(35*35))           \r\n# Erstellt aus der GridTopology und den Daten ein SpatialGridDataFrame\r\ngrid    <- SpatialGridDataFrame(x, data,  proj4string <- CRS(\"+init=epsg:21781\"))\r\npixel  <- as(grid, \"SpatialPixelsDataFrame\")\r\n\r\npoints <- as(pixel, \"SpatialPointsDataFrame\")\r\n\r\ngrid_plot <- st_buffer(st_as_sf(points), 12.5)\r\n\r\nplot(st_geometry(grid_plot))\r\n\r\nggplot(grid_plot, color = \"black\", fill=NA) + \r\n  geom_sf() +\r\ngeom_sf(data = xy_p, color = \"blue\",  ) +\r\n  geom_sf(data = hr, color = \"red\", fill = NA, size = 2) +\r\ncoord_sf(datum = sf::st_crs(21781))+\r\ntheme(\r\naxis.title = element_blank(),\r\naxis.text = element_blank(),\r\naxis.ticks = element_blank(),\r\nlegend.position=\"none\"\r\n)\r\n\r\n\r\n\r\nAufgabe 3: Testen der Variablen der Vegetationsschichten von letzter Woche auf einen linearen Zusammenhang (Korrelation; Funktion cor.test). DG_Baumschicht vs. DG_os / DG_Strauchschicht vs. DG_us aus dem Datensatz df_with_lidar den wir letzte Woche erstellt haben\r\nDie Theorie zu Korrelation folgt erst ab 1.11\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-18T09:00:14+02:00",
    "input_file": {}
  },
  {
    "path": "fallstudien/BE_S_1_Einleitung/",
    "title": "KW40: Einführung",
    "description": {},
    "author": [
      {
        "name": "Adrian Hochreutener",
        "url": {}
      }
    ],
    "date": "2021-09-27",
    "categories": [
      "Biodiversity & Ecosystems (S)"
    ],
    "contents": "\r\nEinleitung\r\nHintergrund\r\nDas rund 1100 ha grosse Naturschutzgebiet Wildnispark Zürich Sihlwald, welches im periurbanen Raum südlich von Zürich liegt, gilt seit dem 1. Januar 2010 als erster national anerkannter Naturerlebnispark. Er ist Teil des Wildnisparks Zürich. Seine Rolle als Naherholungsgebiet für die Stadt Zürich ist von grosser Bedeutung.\r\nIm Perimeter gelten verschiedene Regeln. So darf z. B. nur auf bestimmten Wegen mit den Velo gefahren und Hunde müssen an der Leine geführt werden. Damit soll im Schutzgebiet die Balance zwischen Schutz und Nutzen bewahrt werden, denn einerseits sollen die Besuchenden den Wald erleben dürfen, andererseits soll sich dieser, in der Kernzone, frei entwicklen dürfen.\r\n\r\n\r\n\r\nDamit diese Balance erreicht werden kann, muss das Management auf solide, empirisch erhobene Daten zur Natur und zu den Besuchenden zurückgreifen können. Das Besuchermonitoring deckt den zweiten Teil dieser notwendigen Daten ab.\r\nIm Wildnispark Zürich sind dazu mehrere automatische Zählstellen in Betrieb. Die Zählstellen erfassen stundenweise Besuchende. Einige Zählstellen erfassen richtungsgetrennt und / oder können zwischen verschiedenen Nutzergruppen wie Personen, die zu Fuss gehen, und Velofahrenden unterscheiden.\r\nIm Rahmen des Moduls Research Methods werden in der Fallstudie Profil S mehrere dieser automatischen Zählstellen genauer untersucht. Die Daten, welche im Besitz des WPZ sind, wurden bereits kalibriert. Das heisst, Zählungen während Wartungsarbeiten, bei Felhbetrieb o.ä. wurden bereits ausgeschlossen. Dies ist eine Zeitintensive Arbeit und wir dürfen hier mit einem wahren, sauber aufbereiteten “Datenschatz” arbeiten.\r\nPerimeter des Wildnispark Zürichs mit den ungefähren Standorten von drei ausgewählten automatischen Zählstellen.\r\n\r\n\r\n\r\n\r\nHinweis:\r\nDie Zähler 211 und 502 erfassen sowohl Fussgänger:innen als auch Fahrräder. Die Erfassung erfolgt Richtungsgetrennt.\r\nDer Zähler 204 kann nicht zwischen Nutzungsarten unterscheiden; er erfasst alle Passagen auf den Hochwachtturm als Fussgänger:innen. Der Sensror hat keine Richtungserkennung und die Besuchenden werden jeweils 2x gezählt, einmal beim Aufstieg und einmal beim Abstieg. Das ist im Kalibrierunsgfaktor berücksichtigt, die Kalibrierte Zahl gibt also die Anzahl der Turmbesuche an.\r\nDer Wildnispark wertet die Zahlen auf verschiedene Weise aus. So sind z. B. Jahresgänge (an welchen Monaten herrscht besonders viel Betrieb) und Nutzungszahlen bekannt. Vertiefte Auswertungen, die beispielsweise den Zusammenhang zwischen Besuchszahlen und dem Wetter untersuchen, werden nicht gemacht, da dies die Kapazitäten übersteigen würde.\r\nUnsere Analysen in diesem Modul helfen dem Management, ein besseres Verständnis zum Verhalten der Besuchenden zu erlangen und bilden Grundlagen für Managemententscheide in der Praxis.\r\nZiele\r\nIn dieser Fallstudie zeigen wir, welche Einfluss der Lockdown während der Covid19-Pandemie im Frühjahr 2020 sowie jener im Winter 2020/2021 auf die täglichen Besuchszahlen im Wildnispark Zürich hatte.\r\nErgänzend beschreiben wir den Zusammenhang der Besuchszahlen mit verschiedenen Wetterparametern. Die Hypothese lautet, je mehr Sonnenstunden und je höher die Temperatur, desto mehr Besuchende sind im Untersuchungsgebiet unterwegs; je mehr Niederschlag gemessen wird, desto weniger Besuchende werden gezählt.\r\nDa neben dem Wetter aber auch saisonale Muster, wie z.B. Schulferien, einen grossen Einfluss auf Besuchszahlen haben können, ziehen wir diese und weitere Parameter (Wochentage, Kalenderwoche, Jahr) ebenfalls in die Auswertung ein.\r\nDiese kombinierte, statistisch schliesssende, Betrachtung erlaubt uns Aussagen darüber, ob “nur” aufgrund des schönen Frühlings 2021 mehr Menschen in Wald unterwegs waren, oder ob der Lockdown tatsächlich einen so deutlich positiven Einfluss auf die Besuche hatte.\r\nGrundlagen\r\nZur Verfügung stehen:\r\ndie stündlichen, richtungsgetrennten Zählungen von Fussgänger:innen und Velos an drei Zählstellen\r\nMeteodaten (Temperatur, Sonnenscheindauer, Niederschlagssumme)\r\nR-Skripte mit Hinweisen zur Auswertung\r\n\r\n\r\n\r\n",
    "preview": "fallstudien/BE_S_1_Einleitung/Perimeter.png",
    "last_modified": "2021-10-06T17:08:30+02:00",
    "input_file": {},
    "preview_width": 2001,
    "preview_height": 1051
  },
  {
    "path": "fallstudien/BE_S_2_Felderhebung/",
    "title": "KW40 - KW42: Aufgabe Felderhebung Grüntal",
    "description": {},
    "author": [
      {
        "name": "Adrian Hochreutener",
        "url": {}
      }
    ],
    "date": "2021-10-18",
    "categories": [
      "Biodiversity & Ecosystems (S)"
    ],
    "contents": "\r\nEinführung und Installation\r\nEs gibt eine Vielzahl an möglichen Methoden zur Erfassung der Besucherzahlen. Automatische Zählgeräte bieten die Möglichkeit lange und durchgehende Zeitreihen zu erfassen. Diese müssen aber natürlich auch ausgewertet werden. Hier erhaltet ihr erste Inputs dazu.\r\n\r\n\r\n\r\nZiele\r\nDie Studierenden können das eingesetzte Gerät installieren und kennen die Vor- und Nachteile verschiedener Methoden.\r\nSie können die Daten auslesen und explorativ analysieren.\r\nGrundlagen\r\nDie Geräte werden innerhalb der auf Abbildung 1 gekennzeichneten Standorte platziert. Damit soll überprüft werden, wie stark frequentiert die Waldränder der ökologisch aufgewerteten Seeparzelle sind.\r\n\r\n\r\n\r\nDatenschutz ist ein wichtiges Thema. Die Besuchenden werden über den Zweck der Kameras informiert, die Daten nach der Bearbeitung wieder gelöscht und nicht weitergegeben.\r\n\r\n\r\n\r\nNun geht es ins Feld uns die Geräte werden installiert.\r\nAuswertung\r\nAUFGABE ab dem 12.10.2021\r\nNachdem die Kameras für zwei Wochen im Einsatz standen, werden die Daten ausgelesen, die Sichtungen in Excel festgehalten und die explorativen Analysen durchgeführt.\r\nBereits beim Detektieren der Sichtungen muss einem klar sein, was man auswerten möchte. Nur so können die relevanten Variablen erfasst werden.\r\nIm Rahmen dieser Felderhebung erhaltet ihr von Adrian eine Excel-Vorlage zur Verifizeriung der automatisch detektierten Sichtungen.\r\nVerifiziert kurz, was euch der Algorithmus geliefert hat.\r\nAls nächstes geht es ins R. Da wir für unsere Auswertungen zu wenige Sichtungen haben, verwendet bitte den Datensatz DummyData (ReMe HS21 MSc ENR_/Fallstudie Biodiversity & Ecosystems/S_Daten/Felderhebungen). Eure Verifizierung braucht ihr nicht mehr.\r\nDatenanalyse in R\r\nVorbereitungen\r\nFuer diese Aufgabe benoetigen wir folgende Bibliotheken:\r\n\r\n\r\n# Benoetigte Bibliotheken ####\r\nlibrary(tidyverse) # Data wrangling und piping\r\nlibrary(lubridate) # Arbeiten mit Datumsformaten\r\nlibrary(data.table)# schnelles Dateneinlesen\r\n\r\n\r\n\r\nLese nun zuerst den bereitsgestellen, respektiven den selbst erstellten Datensatz (csv) mithilfe von fread() oder read.csv() ein und nennt ihn cam.\r\nPruefe die Daten. Wurden sie richtig eingelesen? Wie sieht die Struktur der Daten aus?\r\nTipp: Brauch zum pruefen den Befehl str() sowie head().\r\nAufgabe 1: Datentypen\r\nViele Befehle zum Einlesen erkennen die Datentypen automatisch. Bei Faktoren funktioniert das aber nicht (sie sind ja eigentlich einfach Text und R weiss nicht, was wir damit wollen).\r\nAuch das Datum muss vielfach manuell definiert werden (hier muessen wir R sagen, wie das Format dieses aussieht).\r\n\r\n\r\ncam <- cam %>% \r\n  mutate(Datum = as.Date(Datum, format = \"%d.%m.%Y\"))%>%\r\n  mutate(Kamerastandort = factor(Kamerastandort))%>%\r\n  ...\r\n\r\n\r\n\r\nDefiniert nun die restlichen (relevanten) Variablen als Faktor.\r\nAufgabe 2: Datensatz trennen\r\nUnser Datensatz enthaellt die Angeben zu ost und west. Wir wollen die Auswertungen aber pro Standort machen.\r\nTrennt den Datensatz aufgrund des Standorts. Nutzt dazu filter().\r\n\r\n\r\nost <- filter(DATENSATZ, SPALTENNAME == \"Attribut\")\r\nwest <- ...\r\n\r\n\r\n\r\nAufgabe 3: Verteilung pruefen\r\nBei explorativen Analysen macht es immer Sinn sich die Verteilung der Daten anzuschauen. Pruefe daher die Verteilung pro Datensatz mittels Histogram und Scatterplot.\r\nBeim Histogram sollen nur die Menschen angezeigt und die 0er ausgeschlossen werden. Das kann mit folgendem Code erreicht werden:\r\n\r\n\r\nhist(west$Anzahl[west$Art==\"Mensch\" &\r\n                  !west$Anzahl==0], # das \"!\" bedeutet \"nicht gleich\"\r\n     breaks = 10)                   # wie viele Balken brauchen wir im Histogram?\r\n\r\n\r\n\r\nBeim Scatterplot soll auf der x-Achse das Datum stehen, auf der y-Achse die Anzahl der Personen. Auch hier wollen wir keine Wildtiere im Plot.\r\nAufgabe 3: Daten ausschliessen\r\nFuer die weiteren Analysen schliessen wir die Wildtiere komplett aus.\r\nNutzt dazu wiederum den Befehl filter() und ueberschreibt die Datensaetze ost und west.\r\nDennoch wolle wir auch wissen, welche Tiere auf dem Areal (ost und west zusammen, also df cam) unterwegs sind.\r\nDafuer gibts einen separaten Datensatz namens Tiere. Nutzt dazu den Befehl filter().\r\nAufgabe 4: Explorative Analysen\r\nBerechnet zuerst die totale Anzahl Menschen / Standort mit sum(DATENSATZ$SPALTENNAME).\r\nGruppieren und summieren:\r\nBerechnet nun die Anzahl Menschen pro Aktivität sowie die Anzahl Begleittier pro Kategorie pro Standort.\r\nUntenstehender Code eigent sich dazu ganz gut:\r\n\r\n\r\nAkt_Ost <- ost %>%\r\n  group_by(Aktivitaet)%>%      # Hier sagen wir nach was wir gruppieren \r\n  summarise (n = n()) %>%      # und dann sagen wir, dass R zusammenfassen soll und zwar die Anzahl\r\n  mutate(freq = n / sum(n))%>% # und dann soll und R das prozentuale Verhaeltniss berechnen\r\n  arrange(desc(n))             # und dann das ganze absteigend sortieren\r\n\r\n\r\n\r\nNun soll noch berechnet werden, wie viele unterschiedliche Wildtiere auf dem ganzen Areal gezaehlt wurden.\r\nRecycelt dazu obenstenenden Code.\r\nAufgabe 5: Visualisieren\r\nVerteilung der Aktivitäten als Pie Chart\r\nZuerst eine Palette mit 5 Farben definieren:\r\n\r\n\r\npal <- hcl.colors(5, palette = \"heat\")\r\n\r\n\r\n\r\nDann als Kreisdiagramm plotten.\r\n\r\n\r\npie(Akt_West$n, labels = c(\"Anderes\", \"Biker\", \"Landwirtschaft\", \"Spaziergaenger\", \"unbestimmbar\"),\r\n    main = \"Prozentuales Verhaeltnis West\",\r\n    col = pal) \r\n\r\n\r\n\r\n\r\nFRAGE: eignen sich Pie Charts überhaupt für solche Darstellungen? Wie könnten die Aktivitäten auch noch dargestellt werden? Welches sind eure eigenen Ideen zur Visualisierung?\r\nBegleittier als Bar Chart\r\n\r\n\r\n# Begleittier als Bar Chart ####\r\nggplot(Begleit_ost,                      # hier den Datensatz spezifizieren\r\n       mapping=aes(x=Begleittier, y = n))+ # Absolute Anzahl darstellen\r\n  geom_col(width=0.9,position = \"dodge\")+# hier sage ich, dass ich ein Balkendiagramm will\r\n  labs(x=\"Begleittier\", y= \"Anzahl\")+    # Achsenbeschriftung setzen\r\n  theme_classic(base_size = 15)+         # Und zu guter letzt: Stil definieren\r\n  theme(axis.text.x = element_text(angle = 45, vjust = 1, hjust=1)) # sowie Achsenbeschr.ausrichten\r\n\r\n\r\n\r\n\r\nUnd schliesslich: Wildtier als Bar Chart Stellt hier auf der y-Achse die Anzahl nicht total sondern relativ (in Prozent) dar.\r\n\r\n\r\n\r\nBei Bedraf koennen die selben Plots fuer den zweiten Standort gemacht werden.\r\n\r\n\r\n\r\n",
    "preview": "fallstudien/BE_S_2_Felderhebung/gruental.jpg",
    "last_modified": "2021-10-18T09:22:33+02:00",
    "input_file": {}
  },
  {
    "path": "fallstudien/BE_S_3_Aufgabenstellung/",
    "title": "KW 43: Aufgabenstellung Wildnispark",
    "description": {},
    "author": [
      {
        "name": "Adrian Hochreutener",
        "url": {}
      }
    ],
    "date": "2021-10-06",
    "categories": [
      "Biodiversity & Ecosystems (S)"
    ],
    "contents": "\r\nAbschlussbericht über die multivariate Analyse\r\nZiele\r\nBisher habt ihr euch mit dem Untersuchungsgebiet beschäftigt und habt selbst ein (kleines) Besuchermonitoring durchgeführt. Das Besuchermonitoring Grüental ist nun abgeschlossen und wir beschäftigen uns voll und ganz mit dem Wildnispark Zürich.\r\nIm Rahmen dessen programmieren wir multivariate Modelle, welche den Zusammenhang zwischen der Anzahl Besuchenden und verschiedenen Einflussfaktoren (Lockdown, Wetter, Ferien, Wochentag, Kalenderwoche) beschreiben. Dank ihnen können wir sagen, wie die Besucher:innen auf die untersuchten Faktoren reagieren (siehe dazu [Einleitung], Ziele).\r\nKonkret sollen folgende Fragestellungen beantwortet werden:\r\n\r\nWelchen Einfluss haben neben den Lockdowns auch die Wetterparameter (Sonnenscheindauer, Tageshöchsttemperatur, Niederschlagssumme) sowie der Wochentag, die Ferien, die Kalenderwoche und das Jahr auf die Besuchszahlen?\r\nDabei interessiert uns besonders, wie stark die jeweiligen Einflüsse sind, welche Effektrichtungen beobachtbar sind und welche der untersuchten Parameter signifikant sind.\r\nKönnen deutliche Unterschiede zwischen den “normalen”, vor-Covid19-Jahren und danach bei Tages-, Wochen-, und / oder Saisongang sowie den wichtigsten, deskriptiven Kennzahlen gefunden werden?\r\n\r\nJede Gruppe wertet ausschliesslich Daten eines Zählers aus. Sprecht miteinander ab, wer welchen Zähler behandelt (204, 211 oder 502; Spezifikationen siehe [Einleitung], Hinweis). Jeder Zähler soll nur von einer Gruppe ausgewertet werden!\r\nFür euren Zähler stehen eventuell Zahlen zu Fussgänger:innen und Velos zur Verfügung (siehe [Einleitung], Hinweis). Entscheidet euch in diesem Fall selbst, ob ihr Fussgänger:innen ODER Velos auswerten wollt. Die anderen Daten dürft ihr vernachlässigen.\r\nIm Bericht sollen die Informationen und Erfahrungen aus dem gesamten Verlauf der Fallstudie in geeigneter Weise einfliessen. Bezüglich der Felderhebung Grüntal erwarten wir keine Angaben.\r\n\r\n\r\n\r\nErwartungen\r\nStruktur / Aufbau\r\nFragestellung (siehe oben; die Fragestellung ist vorgegeben, darf aber natürlich für den Bericht geschärft und optimal formuliert und konkretisiert werden.)\r\nMethoden (kurzes Kapitel mit den statistischen Analysen)\r\nResultate (deskriptive Statistik, multivariates Modell; kurzer Fliesstext sowie die notwendigen Tabellen und eine Auswahl möglichst informativer Grafiken)\r\nDiskussion (Diskussion der deskriptiven Analysen und der Modellergebnisse; dieser Abschnitt sollte die eigenen Resultate auch im Zusammenhang mit aktueller Fachliteratur reflektieren.)\r\nLiteraturverzeichnis (Tipp: Das Literaturverzeichnis sollte vollständig sein, sowie formal korrekt und einheitlich daherkommen. Wir erwarten speziell in der Diskussion eine Abstützung auf aktuelle Fachliteratur. Auf Moodle haben wir Euch eine Auswahl relevanter Papers bereitgestellt.)\r\nAnhang (für alle Auswertungen relevanter R-Code in geeigneter Form)\r\nGesamtumfang max. 7500 Zeichen (inkl. Leerzeichen; exkl. Einleitung, Tabellen, Literaturverzeichnis und Anhang)\r\nAbgabe am 9.1.2022 auf Moodle oder per Mail an hoce@zhaw.ch\r\nBewertungskriterien\r\nIst die Methode klar und verständlich formuliert?\r\nSind die deskriptiven Analysen klar beschrieben und geeignet visualisiert?\r\nIst die Variablenselektion klar beschrieben, plausibel und nachvollziehbar?\r\nSind die Modellresultate in Text- und Tabellenform korrekt beschrieben und geeignet visualisiert?\r\nIst die Diskussion klar formuliert und inhaltlich schlüssig?\r\nWie gut ist die Diskussion auf relevante und aktuelle Fachliteratur abgestützt?\r\nZusätzliche bewerten wir die inhaltliche Dichte der Arbeit und die formale Qualität (Sprache, Struktur, Aufbau, Darstellung, Literaturverzeichnis, Umgang mit Literatur im Text)\r\nZusammensetzung der Fallstudiennote:\r\nFallstudie-Leistungsnachweis 1 - Forschungsplan: 30%\r\nFallstudie-Leistungsnachweis 2 - Multivariate Analyse: 70%\r\n\r\n\r\n\r\n",
    "preview": "fallstudien/BE_S_3_Aufgabenstellung/Aufbau_Fallstudie_Profil_S.png",
    "last_modified": "2021-10-06T17:01:33+02:00",
    "input_file": {},
    "preview_width": 1429,
    "preview_height": 903
  },
  {
    "path": "fallstudien/BE_S_4_Projektierung/",
    "title": "KW 43: Aufgabe R Projekt vorbereiten",
    "description": {},
    "author": [
      {
        "name": "Adrian Hochreutener",
        "url": {}
      }
    ],
    "date": "2021-10-06",
    "categories": [
      "Biodiversity & Ecosystems (S)"
    ],
    "contents": "\r\nArbeiten mit Projekten\r\nVor den eigentlichen Auswertungen muessen einige Vorbereitungen unternommen werden. Die Zeit, die man hier investiert, wird in der späteren Projektphase um ein Mehrfaches eingespart.\r\n\r\n\r\n\r\nIch empfehle generell mit Projekten zu arbeiten, da diese sehr einfach ausgetauscht (auf verschiedene Rechner) und somit auch reproduziert werden können. Wichtig ist, dass es keine absoluten Arbeitspfade sondern nur relative gibt. Der Datenimport (und -export) kann mithilfe dieser relativen Pfade stark vereinfacht werden. –> Kurz gesagt: Projekte helfen alles am richtigen Ort zu behalten (mehr zur Arbeit mit Projekten: https://support.rstudio.com/hc/en-us/articles/200526207-Using-Projects).\r\nErstellt an einem passenden Speicherort ein neues Projekt mit einem treffenden Namen:\r\n–> File / New Project\r\nAufgabe 1: Projektaufbau\r\nNutzt für allen Text, welcher nicht im Code integriert ist, das Symbol #. Wenn ihr den Text als Titel definieren wollt, so dass er in der Übersicht erscheint, müssen vor dem Wort # und nach dem Wort #### eingefügt werden.\r\n\r\n\r\n# Texte, vor denen ein # und nach denen #### stehen, sind Titel\r\n# Texte, vor denen ein # steht, erklaeren den Ablauf\r\n# Zeilen ohne vorangehendes # sind Operationen\r\n\r\n# Wenn man rechts neben \"Source\" und links neben \"Environment\" klickt \r\n# (oder CTRL + SHIFT + O --> Show document Outline), \r\n# oeffnet sich die UEbersicht zu den UEberschriften\r\n\r\n\r\n\r\nTipp:\r\nAlt + - = <-\r\nCtrl + Shift + M = %>%\r\nCtrl + Shift + C = # vor der ausgewaehlten Zeile\r\nZuerst immer den Titel des Projekts sowie den Autor/ die Autorin des Skripts nennen. Hier soll auch die Herkunft der Daten ersichtlich sein und falls externe Daten verwendet werden, sollte geklärt werden, wer Dateneigentümer ist (Wildnispark und Meteo Schweiz).\r\nIm Skript soll immer die Ordnerstruktur des Projekts genannt werden. So kann der Arbeitsvorgang auf verschiedenen Rechnern einfach reproduziert werden (ich verwende hier ein Projektornder mit den Unterordnern __skripts, data, results).\r\nBeschreibt zudem folgendes die verwendete Meteodaten (siehe dazu Metadata Meteodaten, –> order_XXX_legend.txt)\r\nEin Skript soll in R eigentlich immer (mehr oder weniger) nach dem selbem Schema aufgebaut sein. Dieses Schema enthällt (nach den bereits erwähnten Definitionen) 4 Kapitel:\r\nMetadaten und Definitionen\r\nDatenimport,\r\nVorbereitung,\r\nDeskriptive Analyse und Visualisierung und\r\nMultifaktorielle Analyse und Visualisierung.\r\nBereitet euer Sktipt mit diesen Kapitel vor.\r\n\r\n\r\n#.########################################################################################### Einfluss von COVID19 auf das Naherholungsverhalten in WPZ ####\r\n# Fallstudie Modul Research Methods, HS21. Autor/in ####\r\n#.##########################################################################################\r\n\r\n#.##########################################################################################\r\n# METADATA UND DEFINITIONEN ####\r\n#.##########################################################################################\r\n\r\n# Datenherkunft ####\r\n# ...\r\n\r\n#.##########################################################################################\r\n# 1. DATENIMPORT #####\r\n#.##########################################################################################\r\n\r\n\r\n\r\nAufgabe 2: Laden der Bibliotheken\r\nGeplottet wird mit ggplot, daher wird tidyverse geladen. Diese Bibliothek ergaenzt BASE R in vielerlei Hinsicht uns ist eigentlich fast immer nötig. Da wir es bei Besucherdaten immer mit einem zeitlichen Bezug zu tun haben, benoetigen wir eine passende Bibliothek. Ich arbeite mit lubridate, POSIXct waere natuerlich auch moeglich. Base R bietet verschiedene Funktionen um Daten einzulesen. data.table ergaenzt diese Basisfunktionen sehr gut. ggpubr brauchen wir für das Darstellen von mehreren verschiedenen Plots in nur einem. PerformanceAnalytics, MuMIn, AICcmodavg, fitdistrplus, lme4 und sjPlot werden fuer die spaeteren multivariaten Analysen benoetigt. Die Modellguete werden wir mittels lattice, blmeco und lattice pruefen.\r\nLadet nun also die benoetigten Bibliotheken.\r\nAllenfalls muessen diese zuerst mit install.packages(“NAME”) installiert werden.\r\n\r\n\r\n# Benoetigte Bibliotheken ####\r\nlibrary(tidyverse) # Data wrangling und piping\r\nlibrary(lubridate) # Arbeiten mit Datumsformaten\r\nlibrary(data.table)# schnelles Dateneinlesen\r\nlibrary(ggpubr)    # to arrange multiple plots in one graph\r\nlibrary(PerformanceAnalytics) # Plotte Korrelationsmatrix\r\nlibrary(MuMIn)     # Multi-Model Inference\r\nlibrary(AICcmodavg)# Modellaverageing\r\nlibrary(fitdistrplus)# Prueft die Verteilung in Daten\r\nlibrary(lme4)      # Multivariate Modelle\r\nlibrary(blmeco)    # Bayesian data analysis using linear models\r\nlibrary(sjPlot)    # Plotten von Modellergebnissen (tab_model)\r\nlibrary(lattice)   # einfaches plotten von Zusammenhängen zwischen Variablen\r\n\r\n\r\n\r\nAufgabe 3: Zeitliche Definitionen\r\nDefiniert den zeitlichen Horizont, also Start sowie Ende der Untersuchungen. Bezieht in eure Auswertungen den gesamten verfügbaren Zeitraum ein.\r\nDafür müsst ihr in die Rohdaten eures Zählers schauen. Am einfachsten direkt in der .csv Datei.\r\n\r\n\r\ndepo_start <- as.Date(\"YYYY-MM-DD\")\r\ndepo_end <- ...\r\n\r\n\r\n\r\nWichtiger Teil unserer Auswertungen ist der Einfluss des Lockdown auf das Besuchsverhalten. -Wir müssen also Start und Ende der beiden Lockdowns in der Schweiz definieren:\r\n\r\n\r\nlock_1_start_2020 <- as.Date(\"2020-03-16\")\r\nlock_1_end_2020 <- as.Date(\"2020-05-11\")\r\n\r\nlock_2_start_2021 <- as.Date(\"2020-12-22\")\r\nlock_2_end_2021 <- as.Date(\"2021-03-01\")\r\n\r\n\r\n\r\nEbenfalls müssen die erste und letzte Kalenderwoche der Untersuchungsfrist definiert werden. Diese werden bei wochenweisen Analysen ausgeklammert da sie i.d.R. unvollstaendig sind (das ist ein späterer Arbeitsschritt). Geht wie oben vor. Tipp: der Befehl week() liefert euch die Kalenderwoche.\r\nFerienzeiten können einen grossen Einfluss auf das Besucheraufkommen haben. Die relevanten Ferienzeiträume (in meinem Beispiel ab 2019, je nach dem müsst ihr das anpassen) muüsen daher bekannt sein. Zur Definition der Ferien kann z.B. folgend vorgegangen werden:\r\n\r\n\r\n# (https://www.schulferien.org/schweiz/ferien/2020/)\r\nFruehlingsferien_2019_start <- as.Date(\"2019-04-13\")\r\nFruehlingsferien_2019_ende <- as.Date(\"2019-04-28\")\r\nSommerferien_2019_start <- as.Date(\"2019-07-6\")\r\nSommerferien_2019_ende <- as.Date(\"2019-08-18\")\r\nHerbstferien_2019_start <- as.Date(\"2019-10-05\")\r\nHerbstferien_2019_ende <- as.Date(\"2019-10-20\")\r\nWinterferien_2019_start <- as.Date(\"2019-12-21\")\r\nWinterferien_2019_ende <- as.Date(\"2020-01-02\")\r\n\r\nFruehlingsferien_2020_start <- as.Date(\"2020-04-11\")\r\nFruehlingsferien_2020_ende <- as.Date(\"2020-04-26\")\r\nSommerferien_2020_start <- as.Date(\"2020-07-11\")\r\nSommerferien_2020_ende <- as.Date(\"2020-08-16\")\r\nHerbstferien_2020_start <- as.Date(\"2020-10-03\")\r\nHerbstferien_2020_ende <- as.Date(\"2020-10-18\")\r\nWinterferien_2020_start <- as.Date(\"2020-12-19\")\r\nWinterferien_2020_ende <- as.Date(\"2021-01-03\")\r\n\r\nFruehlingsferien_2021_start <- as.Date(\"2021-04-24\")\r\nFruehlingsferien_2021_ende <- as.Date(\"2021-05-09\")\r\nSommerferien_2021_start <- as.Date(\"2021-07-17\")\r\n\r\n\r\n\r\nNun sind alle Vorbereitungen gemacht, die Projektstruktur aufgebaut und die eigentliche Arbeit kann beginnen.\r\n\r\n\r\n\r\n",
    "preview": "fallstudien/BE_S_4_Projektierung/the-r-project-for-statistical-computing.png",
    "last_modified": "2021-10-06T17:05:24+02:00",
    "input_file": {},
    "preview_width": 797,
    "preview_height": 298
  }
]
