[
  {
    "path": "mce/mce/",
    "title": "Multi-Criteria Evaluation (MCE)",
    "description": "This is a step-by-step guide corresponding to the PPP document \"Multikriterielle Entscheidungsanalyse 1\".",
    "author": [
      {
        "name": "Patrick Laube",
        "url": {}
      },
      {
        "name": "Nils Ratnaweera",
        "url": {}
      },
      {
        "name": "Nikolaos Bakogiannis",
        "url": {}
      },
      {
        "name": "Dominic Lüönd",
        "url": {}
      }
    ],
    "date": "2021-12-03",
    "categories": [
      "mce_"
    ],
    "contents": "\nThis is a step-by-step guide corresponding to the PPP document “Multikriterielle Entscheidungsanalyse 2”. This exercise may seem familiar to some of you, if you have attended the bachelor program. This MCE was already conducted in the bachelor module “GIS” by using ArcGIS Pro and its ModelBuilder (see Figure ).\n\n\n\n(#fig:fig_mce)Process model in ArcGIS Pro ModelBuilder\n\n\n\nThe goal of this exercise is to do the same MCE by just using R. We will mainly use functions from the R packages sf and raster. Please have a look at the process model (Figure ) that was created in ArcGIS Pro and try to figure out which functions in the two R packages correspond to the ones in the model. You will see that there are some similar functions available, but for some calculations a different approach is needed.\n\nExercises:\nExercise 1: Load and view data\nExercise 2: Merge exclusion criteria\nExercise 3: Calculate slope\nExercise 4: Calculate distances to criteria\nExercise 5: Standardize and grade criteria (grading)\nExercise 6: Weighting Criteria with AHP\nExercise 7: Weighted Overlay\nExercise 8: Intersecting potential areas with exclusion criteria\nFunctions used in this exercise:\nbind_rows() (Vector)\nraster() (Raster)\nrasterize() (Raster)\nterrain() (Raster)\ndistance() (Raster)\nreclassify() (Raster)\nmask()\nRaster multiplication\n\nExercises 1: Load and view data\nThe data can be loaded by using the functions raster for raster data and read_sf for vector data. View the available data layers (see Table ) and plot them in an appealing way. For visualization you can use the functions plot for raster data and ggplot for vector data.\nTip: As some data sets are exceeding the boundaries of the study area, you can use the mask function on raster data sets and st_intersection for sf/vector data sets, so only relevant data is included.\n\n\n(#tab:data_table)Data used in this study\n\n\nname\n\n\ndescription\n\n\ntype\n\n\nres\n\n\ngeometry\n\n\ncrs\n\n\nexclusion_area\n\n\ndhm25m.tif\n\n\nTerrain model (m)\n\n\nRaster\n\n\n25m\n\n\n\n\nCH1903/LV03\n\n\nNo\n\n\neis25m.tif\n\n\nIcing frequency (days/year)\n\n\nRaster\n\n\n25m\n\n\n\n\nCH1903/LV03\n\n\nNo\n\n\nwind25m.tif\n\n\nAverage wind speed (dm/s)\n\n\nRaster\n\n\n25m\n\n\n\n\nCH1903/LV03\n\n\nNo\n\n\nBewohnte_Fläche.shp\n\n\nSettlements (incl. buffer 200m)\n\n\nShapefile\n\n\n\n\nPolygon\n\n\nCH1903/LV03\n\n\n(Yes)/Distance\n\n\nNationale_Schutzgebiete.shp\n\n\nNational protection areas\n\n\nShapefile\n\n\n\n\nPolygon\n\n\nCH1903/LV03\n\n\n(Yes)/Distance\n\n\nSeeflächen.shp\n\n\nLake areas\n\n\nShapefile\n\n\n\n\nPolygon\n\n\nCH1903/LV03\n\n\nYes\n\n\nStrassen.shp\n\n\nStreets\n\n\nShapefile\n\n\n\n\nLine\n\n\nCH1903/LV03\n\n\nNo/Distance\n\n\nUntersuchungsgebiet_Schwyz.shp\n\n\nStudy area, canton of Schwyz\n\n\nShapefile\n\n\n\n\nPolygon\n\n\nCH1903/LV03\n\n\nNo\n\n\nWaldgebiete.shp\n\n\nForest areas\n\n\nShapefile\n\n\n\n\nPolygon\n\n\nCH1903/LV03\n\n\n(Yes)/Distance\n\n\n\nExercise 2: Merge exclusion criteria\nMerge the exclusion criteria settlement areas, national protected areas, lake areas and forest areas. These vector data sets are structured as data frames and therefore can be merged by simply combining them. Keep in mind that the data frames have different sizes. Additionally, we need to create a raster out of the newly created vector data set (exclusion area). For that you can use the function rasterize. The output should be a raster with 0 and 1, where the fields of the exclusion area have values of 0 and the remaining fields have values of 1 (see Figure ).\nTip: To achieve a raster with only 0 and 1 use the rasterize options field = 0 and background = 1.\nTip: In order to rasterize vector data, you need to create an empty raster beforehand. This raster should have the same boundaries (extent), resolution and coordinate system (crs) as the other raster sets. Use the following code to do so.\n\n\nlibrary(raster)\nr <- raster(extent(kt_schwyz), \n          resolution = c(25, 25), \n          crs = \"+proj=somerc +lat_0=46.9524055555556 +lon_0=7.43958333333333 +k_0=1 \n          +x_0=600000 +y_0=200000 +ellps=bessel +units=m +no_defs\")\n\n\n\n\n\n\n(#fig:fig_rasterize_exclusion_criteria)Exclusion area in the canton of Schwyz\n\n\n\n\nExercise 3: Calculate slope\nNext, calculate the slope in degrees based on the terrain model (dhm25m). The raster package gives you a very helpful function called terrain.\nTip: When using the terrain function use the following options: opt=“slope”, unit=“degrees”, neighbors=8.\n\n\n\n(#fig:fig_slope)Example output of the calculated slope\n\n\n\n\nExercise 4: Calculate distances to criteria\nWithin the evaluation of suitable sites for wind turbines, the distance to roads, forest areas, national protected areas and inhabited areas are relevant. Depending on the criteria, a short or long distance has a positive influence on the evaluation of potential sites. For this purpose, perform a distance analysis with the selected criteria raster layers. Use the raster function distance for this calculation.\nTip: In order to perform the distance function, you need to rasterize the criteria as well. You can use the same command as in exercise 2 but use only option field = 1.\nTip: Use the mask function again to get only relevant data in the study area.\nAs this process will take quite some time (about 2h), you only need to create the distance for the settlement data set, as the logic for the others stays the same. You can load the other 3 data sets as .tif formats from the folder “/solution_euclidean_distances”.\n\n\n\n(#fig:fig_distance_settlements)Example output for the distances to settlements\n\n\n\n\nExercise 5: Standardize and grade criteria (grading)\nThe data layers slope, wind speed, icing frequency and the in exercise 4 calculated distance layers have different units (dm/s, degrees, d/yr and m). These units can’t be directly calculated with each other. Therefore, the different layers need to be operationalized by performing a linear grading. The linear grading is done by using the function reclassify. Use the standards for the reclassification in Figure .\nTip: Keep in mind the min and max values of each raster layer.\nTip: Here is an example code to reclassify the distances to settlements.\n\n\nreclass_settlements <- c(0,80,0,\n                        80,160,0.1,\n                        160,240,0.2,\n                        240,320,0.3,\n                        320,400,0.4,\n                        400,480,0.5,\n                        480,560,0.6,\n                        560,640,0.7,\n                        640,720,0.8,\n                        720,800,0.9,\n                        800,maxValue(settlements_ed),1.0) %>% matrix(ncol = 3, byrow = TRUE)\nreclass_settlements_ed <- reclassify(settlements_ed, reclass_settlements)\n\n\n\n\n\n\n(#fig:fig_reclassify)Reclassify values for all criteria\n\n\n\n\n\n\n(#fig:fig_dist_settlements_reclass)Example output for the reclassified distances to settlements\n\n\n\n\nExercise 6: Weighting criteria with AHP\nPerform an AHP to weight the criteria underlying the MCE. First compare the criteria in pairs, and then calculate the weights - as you have learned in last weeks lesson. In the end you should have a list of 7 weights as shown below.\nTip: Check exercise 2 and 3 from last week’s session. Use the prepared R code to create your ahp matrix.\n      Wind       Streets          Ice    Settlements       Forest         Slope  Protected areas \n0.33862692    0.09816760    0.06166626    0.24969460    0.03515759    0.18043000      0.03625702 \n\n\nahp_matrix <- c(\n  1, 0, 0, 0, 0, 0, 0, #Wind\n  0, 1, 0, 0, 0, 0, 0, #Distance to streets\n  0, 0, 1, 0, 0, 0, 0, #Ice\n  0, 0, 0, 1, 0, 0, 0, #Distance to settlements\n  0, 0, 0, 0, 1, 0, 0, #Distance to forests\n  0, 0, 0, 0, 0, 1, 0, #Slope\n  0, 0, 0, 0, 0, 0, 1  #Distance to protected areas\n) %>% matrix(ncol = 7, byrow = TRUE)\n\n\n\n\nExercise 7: Weighted Overlay\nThe linearly ranked criteria (Exercise 5) are now to be combined with each other, taking into account the weighting determined using the AHP (Exercise 6). This weighted overlay can be performed by using raster calculations and simply multiplying each criteria with its weight and adding them together (see Figure ).\nTip: As the raster sets have slightly different origins, increase the tolerance by using rasterOptions(tolerance = 0.5).\nTip: Also keep in mind the order of the weights in your list when doing the multiplication.\n\n\n\n(#fig:fig_weighted_overlay)Weighted overall of all criteria\n\n\n\n\nExercise 8: Intersecting potential areas with exclusion criteria\nBy simply multiplying the exclusion layer (result from exercise 2) with the weighted overlay layer (result from exercise 7) we are excluding all areas with value 0 (exclusion areas) and keeping all other areas with value 1 (e.g. 0x3=0, 1x3=3). As a conclusion of the study, create a final plot of the potential areas for wind power plants in the canton of Schwyz (like Figure ). Furthermore, discuss the results obtained and determine three possible locations within which concrete planning of wind power plants would be possible.\n\n\n\n(#fig:fig_final_results)Potential sites for wind power plants in Kt. Schwyz (red = less suitable, green = more suitable)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "preview": "mce/mce/distill-preview.png",
    "last_modified": "2021-12-03T08:47:48+00:00",
    "input_file": {},
    "preview_width": 2916,
    "preview_height": 1732
  }
]
